cask_args appdir: '/Applications'

tap 'facebook/fb'
tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'Schniz/tap'

brew 'ack'
# brew 'awscli'
brew 'coreutils'
brew 'deno'
brew 'fasd'
brew 'fnm'
brew 'git-extras'
brew 'git-fixup'
brew 'go'
brew 'grc'
brew 'httpie'
brew 'idb-companion'
brew 'imagemagick'
brew 'jenv'
brew 'jp2a'
brew 'jq'
brew 'jsonpp'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'rustup-init'
brew 'wget'
brew 'yarn'
brew 'pyenv'
brew 'scrcpy'

# cask '1password'
cask 'aerial'
cask 'android-studio'
cask 'arc'
cask 'bruno'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'font-fira-code'
cask 'graphql-playground'
cask 'obsidian'
cask 'proxyman'
cask 'qlcolorcode' # https://github.com/anthonygelibert/QLColorCode
cask 'qlmarkdown' # https://github.com/toland/qlmarkdown
cask 'qlstephen' # https://github.com/whomwah/qlstephen
cask 'qlvideo' # https://github.com/Marginal/QLVideo
cask 'quicklook-json' # http://www.sagtau.com/quicklookjson.html
cask 'reactotron'
cask 'react-native-debugger'
# cask 'slack'
cask 'spotify'
cask 'suspicious-package' # https://www.mothersruin.com/software/SuspiciousPackage/
cask 'tableplus'
cask 'todoist'
cask 'visual-studio-code'
cask 'webpquicklook' # https://github.com/dchest/webp-quicklook
# cask 'zoomus'
cask 'zulu@17'