cask_args appdir: '/Applications'

tap 'facebook/fb'
tap 'Schniz/tap'
tap 'kong/deck'
tap 'mobile-dev-inc/tap'
tap 'circleci-public/circleci'

# brew 'awscli'
brew 'coreutils'
brew 'fnm'
brew 'git-extras'
brew 'git-fixup'
brew 'grc'
brew 'idb-companion'
brew 'jenv'
brew 'jq'
brew 'jsonpp'
brew 'node'
brew 'openssl'
brew 'pipx'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ruby-build'
brew 'tmux'
brew 'wget'
brew 'yarn'

# cask '1password'
cask 'android-studio'
cask 'arc'
cask 'bruno'
# cask 'docker'
cask 'firefox'
cask 'font-fira-code'
cask 'ghostty'
cask 'obsidian'
# cask 'slack'
cask 'spotify'
cask 'tableplus'
# cask 'zoomus'
brew "ripgrep"
cask "gcloud-cli"
brew "googleworkspace-cli"
brew "typescript-language-server"
brew "tree"
cask "claude"
cask "claude-code@latest"
cask "visual-studio-code"
cask "zulu@17"
brew "gh"
cask "circleci-public/circleci/circleci@next"
cask "whatsapp"
brew "just"
brew "awscli"
brew "mistral-vibe"
cask "postman"
brew "k9s"
brew "teleport"
brew "mysql"
cask "1password-cli"
cask "coderabbit"
brew "deck"
brew "cloudflared"
brew "mcp-publisher"
brew "rtk"
# Multiplayer code editor
cask "zed"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
brew 'mobile-dev-inc/tap/maestro'# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
